Tekla.Structures.Drawing.Weld
The Weld class represents weldings in drawing views that refer to actual welds in the model database.
It has properties and methods to control the graphical representation of welding lines.
Instances of Weld class cannot be inserted with code. These appear in drawings when views are created/updated.
To modify its graphical representation, attributes of Weld class can use .welo setting files.

Tekla.Structures.Drawing.Weld.Attributes
The attributes of the weld.
For more information see Tekla.Structures.Drawing.Weld.WeldAttributes.

Tekla.Structures.Drawing.Weld.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Weld.#ctor
Create instance of Weld

Tekla.Structures.Drawing.Weld.#ctor(System.Boolean)
Create instance of Weld

Tekla.Structures.Drawing.Weld.Delete
Deletes the drawing weld from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Weld.Modify
Calls the system to update/modify the weld.
Class can use .welo setting files to modify graphical representation of the welding lines.
Returns: True on success.

Tekla.Structures.Drawing.Weld.Insert
NOT YET IMPLEMENTED.
Welding lines that refer to welds in the model database appear in views when drawing views are created/updated.
Returns: False.

Tekla.Structures.Drawing.Weld.Select
Selects the drawing weld from the current drawing database.
Returns: True on success.